{
  "_name_or_path": "sentence-transformers/all-mpnet-base-v2",
  "architectures": [
    "MPNetForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "abbreviation",
    "1": "aircraft",
    "2": "aircraft+flight+flight_no",
    "3": "airfare",
    "4": "airfare+flight_time",
    "5": "airline",
    "6": "airline+flight_no",
    "7": "airport",
    "8": "capacity",
    "9": "cheapest",
    "10": "city",
    "11": "day_name",
    "12": "distance",
    "13": "flight",
    "14": "flight+airfare",
    "15": "flight+airline",
    "16": "flight_no",
    "17": "flight_time",
    "18": "ground_fare",
    "19": "ground_service",
    "20": "ground_service+ground_fare",
    "21": "meal",
    "22": "quantity",
    "23": "restriction"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "abbreviation": 0,
    "aircraft": 1,
    "aircraft+flight+flight_no": 2,
    "airfare": 3,
    "airfare+flight_time": 4,
    "airline": 5,
    "airline+flight_no": 6,
    "airport": 7,
    "capacity": 8,
    "cheapest": 9,
    "city": 10,
    "day_name": 11,
    "distance": 12,
    "flight": 13,
    "flight+airfare": 14,
    "flight+airline": 15,
    "flight_no": 16,
    "flight_time": 17,
    "ground_fare": 18,
    "ground_service": 19,
    "ground_service+ground_fare": 20,
    "meal": 21,
    "quantity": 22,
    "restriction": 23
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "mpnet",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "relative_attention_num_buckets": 32,
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "unique_labels": [
    "abbreviation",
    "aircraft",
    "aircraft+flight+flight_no",
    "airfare",
    "airfare+flight_time",
    "airline",
    "airline+flight_no",
    "airport",
    "capacity",
    "cheapest",
    "city",
    "day_name",
    "distance",
    "flight",
    "flight+airfare",
    "flight+airline",
    "flight_no",
    "flight_time",
    "ground_fare",
    "ground_service",
    "ground_service+ground_fare",
    "meal",
    "quantity",
    "restriction"
  ],
  "vocab_size": 30527
}
